article/R.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="zh_CN" xml:lang="zh_CN">
<head>
<title>R Language</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="R Language"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-03-01"/>
<meta name="author" content="Justin Jiang"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="shortcut icon" href="/image/favicon.ico" />
<link rel="stylesheet" href="/article/res/css/common2.css" type="text/css">
<link rel="stylesheet" type="text/css"  charset="utf-8" media="screen" href="/article/res/css/screen.css"/>
<link rel="stylesheet" type="text/css" charset="utf-8" media="print" href="/article/res/css/print.css"/>
<!--[if IE]><link rel="stylesheet" type="text/css" charset="utf-8" href="/article/res/css/iehacks.css"/>
<![endif]-->
<!--[if lte IE 6]><link rel="stylesheet" type="text/css" charset="utf-8" href="/article/res/css/ie6hacks.css"/>
<![endif]-->
            
</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">R Language</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 R Language</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><a name="ID-ced4d2a0-2b07-4310-96e8-89935e5b429a" id="ID-ced4d2a0-2b07-4310-96e8-89935e5b429a"></a><span class="section-number-2">1</span> R Language &nbsp;&nbsp;&nbsp;<span class="tag"><span class="ATTACH">ATTACH</span></span></h2>
<div class="outline-text-2" id="text-1">


<p>
fdsfbff \(e=mc^2\) dfsfsdfs $$e=mc^2$$ dfsfd
</p>




<pre class="example"><span id="coderef-name" class="coderef-off"><span class="linenr">1:  </span>fsdf  (name)</span>
</pre>


<p>
<a href="#coderef-name" class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-name');" onmouseout="CodeHighlightOff(this, 'coderef-name');">(name)</a>line
</p>
<p>
<b>fsfsf</b> <code>fdsfsd</code>
</p>



<pre class="example">fsfa
</pre>




\begin{equation}
x=\sqrt{b}
\end{equation}



<pre class="src src-python"><span style="color: #afeeee; font-weight: bold;">print</span> <span style="color: #87cefa;">"hello"</span>
</pre>


\begin{equation}
\setcounter{equation}{3}
E=mc^2
\end{equation}

<p>
     The mass if the sun is M<sub>sun</sub> = 1.989 x 10<sup>30</sup> kg.  The radius of
     the sun is R<sub>sun</sub><sup>2<sup>2</sup></sup> = 6.96 x 10<sup>8</sup> m.
</p>

<p>
If \(a^2=b\) and \( b=2 \), then the solution must be
either $$ a=+\sqrt{2} $$ or \[ a=-\sqrt{2} \].
</p>



<pre class="src src-emacs-lisp"><span id="coderef-sc" class="coderef-off"><span class="linenr">1:  </span>(<span style="color: #afeeee; font-weight: bold;">save-excursion</span>                  (sc)</span>
<span id="coderef-jump" class="coderef-off"><span class="linenr">2:  </span>   (goto-char (point-min))       (jump)</span>
<span id="coderef-sc" class="coderef-off"><span class="linenr">3:  </span>(<span style="color: #afeeee; font-weight: bold;">save-excursion</span>                  (sc)</span>
<span id="coderef-jump" class="coderef-off"><span class="linenr">4:  </span>   (goto-char (point-min))       (jump)</span>
<span id="coderef-sc" class="coderef-off"><span class="linenr">5:  </span>(<span style="color: #afeeee; font-weight: bold;">save-excursion</span>                  (sc)</span>
<span id="coderef-jump" class="coderef-off"><span class="linenr">6:  </span>   (goto-char (point-min))       (jump)</span>
<span id="coderef-sc" class="coderef-off"><span class="linenr">7:  </span>(<span style="color: #afeeee; font-weight: bold;">save-excursion</span>                  (sc)</span>
<span id="coderef-jump" class="coderef-off"><span class="linenr">8:  </span>   (goto-char (point-min))       (jump)</span>
<span class="linenr">9:  </span>
</pre>

<p>
In line <a href="#coderef-sc" class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-sc');" onmouseout="CodeHighlightOff(this, 'coderef-sc');">(sc)</a> we remember the current position.  <a href="#coderef-jump" class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-jump');" onmouseout="CodeHighlightOff(this, 'coderef-jump');">Line (jump)</a>
jumps to point-min.
</p>




<p><textarea cols="80" rows="1">fac 5
</textarea>
</p>


<p>
fsdfsdf
</p></div>
</div>
</div>

<div id="postamble">
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
